{"format": "layers-model", "generatedBy": "keras v2.5.0", "convertedBy": "TensorFlow.js Converter v3.7.0", "modelTopology": {"keras_version": "2.5.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_3", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 200, 200, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv2d_6_input"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_6", "trainable": true, "batch_input_shape": [null, 200, 200, 3], "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_7", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"name": "flatten_3", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_6", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_7", "trainable": true, "dtype": "float32", "units": 17, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": "categorical_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "categorical_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "SGD", "config": {"name": "SGD", "learning_rate": 9.999999747378752e-05, "decay": 0.0, "momentum": 0.8999999761581421, "nesterov": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of76.bin", "group1-shard2of76.bin", "group1-shard3of76.bin", "group1-shard4of76.bin", "group1-shard5of76.bin", "group1-shard6of76.bin", "group1-shard7of76.bin", "group1-shard8of76.bin", "group1-shard9of76.bin", "group1-shard10of76.bin", "group1-shard11of76.bin", "group1-shard12of76.bin", "group1-shard13of76.bin", "group1-shard14of76.bin", "group1-shard15of76.bin", "group1-shard16of76.bin", "group1-shard17of76.bin", "group1-shard18of76.bin", "group1-shard19of76.bin", "group1-shard20of76.bin", "group1-shard21of76.bin", "group1-shard22of76.bin", "group1-shard23of76.bin", "group1-shard24of76.bin", "group1-shard25of76.bin", "group1-shard26of76.bin", "group1-shard27of76.bin", "group1-shard28of76.bin", "group1-shard29of76.bin", "group1-shard30of76.bin", "group1-shard31of76.bin", "group1-shard32of76.bin", "group1-shard33of76.bin", "group1-shard34of76.bin", "group1-shard35of76.bin", "group1-shard36of76.bin", "group1-shard37of76.bin", "group1-shard38of76.bin", "group1-shard39of76.bin", "group1-shard40of76.bin", "group1-shard41of76.bin", "group1-shard42of76.bin", "group1-shard43of76.bin", "group1-shard44of76.bin", "group1-shard45of76.bin", "group1-shard46of76.bin", "group1-shard47of76.bin", "group1-shard48of76.bin", "group1-shard49of76.bin", "group1-shard50of76.bin", "group1-shard51of76.bin", "group1-shard52of76.bin", "group1-shard53of76.bin", "group1-shard54of76.bin", "group1-shard55of76.bin", "group1-shard56of76.bin", "group1-shard57of76.bin", "group1-shard58of76.bin", "group1-shard59of76.bin", "group1-shard60of76.bin", "group1-shard61of76.bin", "group1-shard62of76.bin", "group1-shard63of76.bin", "group1-shard64of76.bin", "group1-shard65of76.bin", "group1-shard66of76.bin", "group1-shard67of76.bin", "group1-shard68of76.bin", "group1-shard69of76.bin", "group1-shard70of76.bin", "group1-shard71of76.bin", "group1-shard72of76.bin", "group1-shard73of76.bin", "group1-shard74of76.bin", "group1-shard75of76.bin", "group1-shard76of76.bin"], "weights": [{"name": "conv2d_6/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "conv2d_6/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_7/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "conv2d_7/bias", "shape": [64], "dtype": "float32"}, {"name": "dense_6/kernel", "shape": [614656, 128], "dtype": "float32"}, {"name": "dense_6/bias", "shape": [128], "dtype": "float32"}, {"name": "dense_7/kernel", "shape": [128, 17], "dtype": "float32"}, {"name": "dense_7/bias", "shape": [17], "dtype": "float32"}]}]}